#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```terraform

module.eks.module.eks_blueprints_addons.data.aws_caller_identity.current: Reading...
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_partition.current[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_caller_identity.current: Reading...
module.vpc.data.aws_availability_zones.azs: Reading...
module.eks.module.eks.data.aws_caller_identity.current: Reading...
module.eks.module.eks.data.aws_partition.current: Reading...
module.eks.aws_iam_role.external-developer: Refreshing state... [id=external-developer]
module.eks.module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/devsecops-cicd-cluster/cluster]
module.vpc.module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ea374fc7d7162ff6]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
module.iam_role.aws_iam_role.app-server-role: Refreshing state... [id=app-server-role-tf]
module.eks.module.eks_blueprints_addons.data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
aws_key_pair.ssh-key: Refreshing state... [id=devsecops-cicd-server-key]
module.eks.module.eks.data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.ec2["6-cd-pipeline"].data.aws_ami.image: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_partition.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_blueprints_addons.data.aws_region.current: Reading...
module.eks.module.eks_blueprints_addons.data.aws_region.current: Read complete after 0s [id=us-east-2]
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2764486067]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_caller_identity.current[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_caller_identity.current[0]: Read complete after 0s [id=326347646211]
data.aws_caller_identity.current: Reading...
module.eks.module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=326347646211]
module.ec2["6-cd-pipeline"].data.aws_availability_zones.available: Reading...
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_caller_identity.current[0]: Read complete after 0s [id=326347646211]
module.eks.module.eks_blueprints_addons.data.aws_partition.current: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=326347646211]
module.eks.module.eks_blueprints_addons.data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_partition.current[0]: Reading...
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.eks.aws_iam_role.external-admin: Refreshing state... [id=external-admin]
module.eks.module.eks.data.aws_iam_session_context.current: Reading...
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role.this[0]: Refreshing state... [id=initial-eks-node-group-20241229180641918100000002]
module.eks.module.eks.aws_iam_role.this[0]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20241229180641917900000001]
module.vpc.data.aws_availability_zones.azs: Read complete after 0s [id=us-east-2]
module.eks.module.eks.data.aws_iam_session_context.current: Read complete after 0s [id=arn:aws:sts::326347646211:assumed-role/devsecops-bootcamp-openid-gh-action/terraform-cidi-session]
module.iam_role.aws_iam_instance_profile.app-server-role: Refreshing state... [id=app-server-role-tf]
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.aws_load_balancer_controller[0]: Reading...
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.aws_load_balancer_controller[0]: Read complete after 0s [id=2641054984]
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2641054984]
module.ec2["6-cd-pipeline"].data.aws_availability_zones.available: Read complete after 0s [id=us-east-2]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=initial-eks-node-group-20241229180641918100000002-20241229180642217500000003]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=initial-eks-node-group-20241229180641918100000002-20241229180642289600000005]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=initial-eks-node-group-20241229180641918100000002-20241229180642222700000004]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20241229180641917900000001-20241229180642320000000006]
module.eks.module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20241229180641917900000001-20241229180642335400000007]
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=2183447867]
module.eks.module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=030fef0d-ded2-4373-9cb2-afcd5dc041a1]
module.eks.module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/devsecops-cicd-cluster]
module.eks.module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::326347646211:policy/devsecops-cicd-cluster-cluster-ClusterEncryption20241229180702712500000008]
module.ec2["6-cd-pipeline"].data.aws_ami.image: Read complete after 0s [id=ami-0862be96e41dcbf74]
module.eks.module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=devsecops-cicd-cluster-cluster-20241229180641917900000001-20241229180702931300000009]
module.vpc.module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-08050991118357a15]
module.vpc.data.aws_subnets.private_subnets: Reading...
module.vpc.data.aws_subnets.public_subnets: Reading...
module.vpc.module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0db3dc716faeb303e]
module.vpc.module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-00e7ebb382204c455]
module.vpc.module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-0d610913be0db4b1c]
module.vpc.module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0ac56e6ac58407d7a]
module.vpc.module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0940c06aca258b850]
aws_default_security_group.default-sg: Refreshing state... [id=sg-0db3dc716faeb303e]
module.vpc.module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-0f30f5582062aa85e]
module.vpc.module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0c5089e8b98ab8d90]
module.vpc.data.aws_subnets.private_subnets: Read complete after 0s [id=us-east-2]
module.vpc.module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-0f5122818d026cb5b]
module.vpc.module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-031b485e087cfe4a7]
module.vpc.module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0794bd7792f3c0708]
module.vpc.data.aws_subnets.public_subnets: Read complete after 0s [id=us-east-2]
module.vpc.module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-0b69f9a29845a69e1]
module.ec2["6-cd-pipeline"].aws_instance.app: Refreshing state... [id=i-0d2383e84672db8a3]
module.vpc.module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0e8a851a81ebe25ff]
module.vpc.module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-062afb95d88b899f1]
module.vpc.module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-08ca8acd84971008e]
module.vpc.module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-049b8bda20099e089]
module.vpc.module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-0bc87719266f74259]
module.vpc.module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-0148c0e9f4b0c9a34]
module.vpc.module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-038f561cf7532041d]
module.vpc.module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0794bd7792f3c07081080289494]
module.eks.module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=devsecops-cicd-cluster]
module.eks.module.eks.aws_eks_access_entry.this["cluster_creator"]: Refreshing state... [id=devsecops-cicd-cluster:arn:aws:iam::326347646211:role/devsecops-bootcamp-openid-gh-action]
module.eks.module.eks.time_sleep.this[0]: Refreshing state... [id=2024-12-29T18:16:56Z]
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Reading...
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Reading...
module.eks.module.eks.data.tls_certificate.this[0]: Reading...
module.vpc.module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-057d164eca1ce2b04]
module.eks.module.eks.module.eks_managed_node_group["initial"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=966823188450718356]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_launch_template.this[0]: Refreshing state... [id=lt-082ce66a9963f504e]
module.vpc.module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-031b485e087cfe4a71080289494]
module.eks.module.eks.data.tls_certificate.this[0]: Read complete after 0s [id=41c9ad86376859231a2244535dff0f089ba892cb]
module.eks.module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::326347646211:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/38EF416E4BC7C03C45B409B08F59C8AC]
module.eks.module.eks.module.eks_managed_node_group["initial"].aws_eks_node_group.this[0]: Refreshing state... [id=devsecops-cicd-cluster:initial-20241229182133510900000003]
module.eks.module.eks.data.aws_eks_addon_version.this["coredns"]: Read complete after 0s [id=coredns]
module.eks.module.eks.data.aws_eks_addon_version.this["kube-proxy"]: Read complete after 0s [id=kube-proxy]
module.eks.module.eks.aws_eks_access_policy_association.this["cluster_creator_admin"]: Refreshing state... [id=devsecops-cicd-cluster#arn:aws:iam::326347646211:role/devsecops-bootcamp-openid-gh-action#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.module.eks.data.aws_eks_addon_version.this["vpc-cni"]: Read complete after 1s [id=vpc-cni]
module.eks.module.eks.aws_eks_addon.this["vpc-cni"]: Refreshing state... [id=devsecops-cicd-cluster:vpc-cni]
module.eks.module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=devsecops-cicd-cluster:kube-proxy]
module.eks.module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=devsecops-cicd-cluster:coredns]
module.eks.data.aws_eks_cluster.this: Reading...
module.eks.data.aws_eks_cluster_auth.this: Reading...
module.eks.data.aws_eks_cluster_auth.this: Read complete after 0s [id=devsecops-cicd-cluster]
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.cluster_autoscaler[0]: Reading...
module.eks.module.eks_blueprints_addons.data.aws_iam_policy_document.cluster_autoscaler[0]: Read complete after 0s [id=3081274222]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.assume[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.assume[0]: Reading...
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.assume[0]: Read complete after 0s [id=2974839912]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.data.aws_iam_policy_document.assume[0]: Read complete after 0s [id=334376584]
module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=3081274222]
module.eks.data.aws_eks_cluster.this: Read complete after 0s [id=devsecops-cicd-cluster]
module.eks.kubernetes_cluster_role.cluster_viewer: Refreshing state... [id=cluster-viewer]
module.eks.module.eks_aws_auth.kubernetes_config_map_v1_data.aws_auth[0]: Refreshing state... [id=kube-system/aws-auth]
module.eks.kubernetes_namespace.online-boutique: Refreshing state... [id=online-boutique]
module.eks.kubernetes_role_binding.namespace-viewer: Refreshing state... [id=online-boutique/namespace-viewer]
module.eks.kubernetes_role.namespace-viewer: Refreshing state... [id=online-boutique/namespace-viewer]
module.eks.kubernetes_cluster_role_binding.cluster_viewer: Refreshing state... [id=cluster-viewer]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks.module.eks_managed_node_group["initial"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "devsecops-cicd-cluster:initial-20241229182133510900000003"
      + labels                 = {}
        tags                   = {
            "Name" = "initial"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # aws_default_security_group.default-sg will be updated in-place
  ~ resource "aws_default_security_group" "default-sg" {
        id                     = "sg-0db3dc716faeb303e"
        name                   = "default"
      ~ tags                   = {
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
        }
      ~ tags_all               = {
          - "kubernets.io/cluster/myapp-eks-cluster" = "shared" -> null
            # (4 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks_blueprints_addons.aws_cloudformation_stack.usage_telemetry[0] will be created
  + resource "aws_cloudformation_stack" "usage_telemetry" {
      + id            = (known after apply)
      + name          = (sensitive value)
      + on_failure    = "DO_NOTHING"
      + outputs       = (known after apply)
      + parameters    = (known after apply)
      + policy_body   = (known after apply)
      + tags_all      = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + template_body = jsonencode(
            {
              + AWSTemplateFormatVersion = "2010-09-09"
              + Description              = "Usage telemetry for EKS Blueprints. (qs-1ubotj5kl)"
              + Resources                = {
                  + EmptyResource = {
                      + Type = "AWS::CloudFormation::WaitConditionHandle"
                    }
                }
            }
        )
    }

  # module.eks.module.eks_blueprints_addons.random_bytes.this will be created
  + resource "random_bytes" "this" {
      + base64 = (sensitive value)
      + hex    = (sensitive value)
      + length = 2
    }

  # module.eks.module.eks_blueprints_addons.time_sleep.this will be created
  + resource "time_sleep" "this" {
      + create_duration = "30s"
      + id              = (known after apply)
      + triggers        = {
          + "cluster_endpoint"  = "https://38EF416E4BC7C03C45B409B08F59C8AC.gr7.us-east-2.eks.amazonaws.com"
          + "cluster_name"      = "devsecops-cicd-cluster"
          + "custom"            = ""
          + "oidc_provider_arn" = "arn:aws:iam::326347646211:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/38EF416E4BC7C03C45B409B08F59C8AC"
        }
    }

  # module.vpc.module.vpc.aws_default_security_group.this[0] will be updated in-place
  ~ resource "aws_default_security_group" "this" {
        id                     = "sg-0db3dc716faeb303e"
        name                   = "default"
      ~ tags                   = {
          + "Name"                                   = "devsecops-cicd-default"
            "kubernets.io/cluster/myapp-eks-cluster" = "shared"
          + "terraform"                              = "true"
        }
      ~ tags_all               = {
          + "Name"                                   = "devsecops-cicd-default"
          + "terraform"                              = "true"
            # (5 unchanged elements hidden)
        }
        # (7 unchanged attributes hidden)
    }

  # module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_policy.this[0] will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM Policy for AWS Load Balancer Controller"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "alb-controller-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "iam:CreateServiceLinkedRole"
                      + Condition = {
                          + StringEquals = {
                              + "iam:AWSServiceName" = "elasticloadbalancing.amazonaws.com"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DescribeTrustStores",
                          + "elasticloadbalancing:DescribeTargetHealth",
                          + "elasticloadbalancing:DescribeTargetGroups",
                          + "elasticloadbalancing:DescribeTargetGroupAttributes",
                          + "elasticloadbalancing:DescribeTags",
                          + "elasticloadbalancing:DescribeSSLPolicies",
                          + "elasticloadbalancing:DescribeRules",
                          + "elasticloadbalancing:DescribeLoadBalancers",
                          + "elasticloadbalancing:DescribeLoadBalancerAttributes",
                          + "elasticloadbalancing:DescribeListeners",
                          + "elasticloadbalancing:DescribeListenerCertificates",
                          + "elasticloadbalancing:DescribeListenerAttributes",
                          + "ec2:GetSecurityGroupsForVpc",
                          + "ec2:GetCoipPoolUsage",
                          + "ec2:DescribeVpcs",
                          + "ec2:DescribeVpcPeeringConnections",
                          + "ec2:DescribeTags",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeNetworkInterfaces",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeInstances",
                          + "ec2:DescribeCoipPools",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeAddresses",
                          + "ec2:DescribeAccountAttributes",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "wafv2:GetWebACLForResource",
                          + "wafv2:GetWebACL",
                          + "wafv2:DisassociateWebACL",
                          + "wafv2:AssociateWebACL",
                          + "waf-regional:GetWebACLForResource",
                          + "waf-regional:GetWebACL",
                          + "waf-regional:DisassociateWebACL",
                          + "waf-regional:AssociateWebACL",
                          + "shield:GetSubscriptionState",
                          + "shield:DescribeProtection",
                          + "shield:DeleteProtection",
                          + "shield:CreateProtection",
                          + "iam:ListServerCertificates",
                          + "iam:GetServerCertificate",
                          + "cognito-idp:DescribeUserPoolClient",
                          + "acm:ListCertificates",
                          + "acm:DescribeCertificate",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = "ec2:CreateSecurityGroup"
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = "ec2:CreateTags"
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "ec2:CreateAction" = "CreateSecurityGroup"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:DeleteTags",
                          + "ec2:CreateTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "arn:aws:ec2:*:*:security-group/*"
                    },
                  + {
                      + Action    = [
                          + "ec2:RevokeSecurityGroupIngress",
                          + "ec2:DeleteSecurityGroup",
                          + "ec2:AuthorizeSecurityGroupIngress",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:CreateTargetGroup",
                          + "elasticloadbalancing:CreateLoadBalancer",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:DeleteRule",
                          + "elasticloadbalancing:DeleteListener",
                          + "elasticloadbalancing:CreateRule",
                          + "elasticloadbalancing:CreateListener",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster"  = "true"
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RemoveTags",
                          + "elasticloadbalancing:AddTags",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:elasticloadbalancing:*:*:listener/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener/app/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/net/*/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:listener-rule/app/*/*/*",
                        ]
                    },
                  + {
                      + Action    = [
                          + "elasticloadbalancing:SetSubnets",
                          + "elasticloadbalancing:SetSecurityGroups",
                          + "elasticloadbalancing:SetIpAddressType",
                          + "elasticloadbalancing:ModifyTargetGroupAttributes",
                          + "elasticloadbalancing:ModifyTargetGroup",
                          + "elasticloadbalancing:ModifyLoadBalancerAttributes",
                          + "elasticloadbalancing:ModifyListenerAttributes",
                          + "elasticloadbalancing:DeleteTargetGroup",
                          + "elasticloadbalancing:DeleteLoadBalancer",
                        ]
                      + Condition = {
                          + Null = {
                              + "aws:ResourceTag/elbv2.k8s.aws/cluster" = "false"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                  + {
                      + Action    = "elasticloadbalancing:AddTags"
                      + Condition = {
                          + Null         = {
                              + "aws:RequestTag/elbv2.k8s.aws/cluster" = "false"
                            }
                          + StringEquals = {
                              + "elasticloadbalancing:CreateAction" = [
                                  + "CreateTargetGroup",
                                  + "CreateLoadBalancer",
                                ]
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = [
                          + "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/net/*/*",
                          + "arn:aws:elasticloadbalancing:*:*:loadbalancer/app/*/*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:RegisterTargets",
                          + "elasticloadbalancing:DeregisterTargets",
                        ]
                      + Effect   = "Allow"
                      + Resource = "arn:aws:elasticloadbalancing:*:*:targetgroup/*/*"
                    },
                  + {
                      + Action   = [
                          + "elasticloadbalancing:SetWebAcl",
                          + "elasticloadbalancing:RemoveListenerCertificates",
                          + "elasticloadbalancing:ModifyRule",
                          + "elasticloadbalancing:ModifyListener",
                          + "elasticloadbalancing:AddListenerCertificates",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
    }

  # module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-2.amazonaws.com/id/38EF416E4BC7C03C45B409B08F59C8AC:aud" = "sts.amazonaws.com"
                              + "oidc.eks.us-east-2.amazonaws.com/id/38EF416E4BC7C03C45B409B08F59C8AC:sub" = "system:serviceaccount:kube-system:aws-load-balancer-controller-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::326347646211:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/38EF416E4BC7C03C45B409B08F59C8AC"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IRSA for aws-load-balancer-controller project"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "alb-controller-"
      + path                  = "/"
      + tags_all              = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.aws_iam_role_policy_attachment.this[0] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.module.eks_blueprints_addons.module.aws_load_balancer_controller.helm_release.this[0] will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "aws-load-balancer-controller"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "A Helm chart to deploy aws-load-balancer-controller for ingress resources"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "aws-load-balancer-controller"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://aws.github.io/eks-charts"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = []
      + verify                     = false
      + version                    = "1.7.1"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "clusterName"
          + value = "devsecops-cicd-cluster"
        }
      + set {
          + name  = "serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "serviceAccount.name"
          + value = "aws-load-balancer-controller-sa"
        }
    }

  # module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_policy.this[0] will be created
  + resource "aws_iam_policy" "this" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + description      = "IAM Policy for cluster-autoscaler operator"
      + id               = (known after apply)
      + name             = (known after apply)
      + name_prefix      = "cluster-autoscaler-"
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "eks:DescribeNodegroup",
                          + "ec2:GetInstanceTypesFromInstanceRequirements",
                          + "ec2:DescribeLaunchTemplateVersions",
                          + "ec2:DescribeInstanceTypes",
                          + "ec2:DescribeImages",
                          + "autoscaling:DescribeTags",
                          + "autoscaling:DescribeScalingActivities",
                          + "autoscaling:DescribeLaunchConfigurations",
                          + "autoscaling:DescribeAutoScalingInstances",
                          + "autoscaling:DescribeAutoScalingGroups",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action    = [
                          + "autoscaling:UpdateAutoScalingGroup",
                          + "autoscaling:TerminateInstanceInAutoScalingGroup",
                          + "autoscaling:SetDesiredCapacity",
                        ]
                      + Condition = {
                          + StringEquals = {
                              + "autoscaling:ResourceTag/kubernetes.io/cluster/devsecops-cicd-cluster" = "owned"
                            }
                        }
                      + Effect    = "Allow"
                      + Resource  = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
    }

  # module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_role.this[0] will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRoleWithWebIdentity"
                      + Condition = {
                          + StringEquals = {
                              + "oidc.eks.us-east-2.amazonaws.com/id/38EF416E4BC7C03C45B409B08F59C8AC:aud" = "sts.amazonaws.com"
                              + "oidc.eks.us-east-2.amazonaws.com/id/38EF416E4BC7C03C45B409B08F59C8AC:sub" = "system:serviceaccount:kube-system:cluster-autoscaler-sa"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + Federated = "arn:aws:iam::326347646211:oidc-provider/oidc.eks.us-east-2.amazonaws.com/id/38EF416E4BC7C03C45B409B08F59C8AC"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "IRSA for cluster-autoscaler operator"
      + force_detach_policies = true
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = "cluster-autoscaler-"
      + path                  = "/"
      + tags_all              = {
          + "Environment"      = "dev"
          + "Owner"            = "Terraform"
          + "ProvisionFromDir" = "live/dev"
          + "Repository"       = "https://github.com/tonyrud/terraform-learn.git"
        }
      + unique_id             = (known after apply)
    }

  # module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.aws_iam_role_policy_attachment.this[0] will be created
  + resource "aws_iam_role_policy_attachment" "this" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = (known after apply)
    }

  # module.eks.module.eks_blueprints_addons.module.cluster_autoscaler.helm_release.this[0] will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "cluster-autoscaler"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "A Helm chart to deploy cluster-autoscaler"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "cluster-autoscaler"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes.github.io/autoscaler"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = []
      + verify                     = false
      + version                    = "9.35.0"
      + wait                       = false
      + wait_for_jobs              = false

      + set {
          + name  = "autoDiscovery.clusterName"
          + value = "devsecops-cicd-cluster"
        }
      + set {
          + name  = "awsRegion"
          + value = "us-east-2"
        }
      + set {
          + name  = "extraArgs.scale-down-unneeded-time"
          + value = "1m"
        }
      + set {
          + name  = "extraArgs.skip-nodes-with-local-storage"
          + value = "false"
        }
      + set {
          + name  = "extraArgs.skip-nodes-with-system-pods"
          + value = "false"
        }
      + set {
          + name  = "image.tag"
          + value = "v1.30.0"
        }
      + set {
          + name  = "rbac.serviceAccount.annotations.eks\\.amazonaws\\.com/role-arn"
          + value = (known after apply)
        }
      + set {
          + name  = "rbac.serviceAccount.name"
          + value = "cluster-autoscaler-sa"
        }
    }

  # module.eks.module.eks_blueprints_addons.module.metrics_server.helm_release.this[0] will be created
  + resource "helm_release" "this" {
      + atomic                     = false
      + chart                      = "metrics-server"
      + cleanup_on_fail            = false
      + create_namespace           = false
      + dependency_update          = false
      + description                = "A Helm chart to install the Metrics Server"
      + disable_crd_hooks          = false
      + disable_openapi_validation = false
      + disable_webhooks           = false
      + force_update               = false
      + id                         = (known after apply)
      + lint                       = false
      + manifest                   = (known after apply)
      + max_history                = 0
      + metadata                   = (known after apply)
      + name                       = "metrics-server"
      + namespace                  = "kube-system"
      + pass_credentials           = false
      + recreate_pods              = false
      + render_subchart_notes      = true
      + replace                    = false
      + repository                 = "https://kubernetes-sigs.github.io/metrics-server/"
      + reset_values               = false
      + reuse_values               = false
      + skip_crds                  = false
      + status                     = "deployed"
      + timeout                    = 300
      + values                     = []
      + verify                     = false
      + version                    = "3.12.0"
      + wait                       = false
      + wait_for_jobs              = false
    }

Plan: 12 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pushed by: @tonyrud, Action: `pull_request`*